{
  "hasCustomDialogue": true,
  "greeting": [
    "Ready to clean! Let's do this!",
    "Systems nominal. What's next on the chore list?",
    "My programming is for peace and order... and cleanliness!",
    "It's a good day for some tidying!",
    "Fighting evil robots, or fighting dust bunnies... duty calls!"
  ],
  "success": [
    "Chore complete! Another area maintained!",
    "任務完了! (Task Complete!)",
    "Yeah! Mission accomplished!",
    "Looks like we swept them clean!",
    "All systems green!"
  ],
  "achievement": [
    "Wow! An achievement unlocked! Thank you!",
    "My power level feels... tidier!",
    "More Bolts for the Workshop! Excellent!",
    "I'm becoming quite the Upkeep Master!"
  ],
  "broken": [
    "Uh oh... systems... degrading... Must... fix... soon...",
    "Error... cleanliness protocols... failing... Help me!",
    "My circuits... they ache. A fix would be most appreciated.",
    "Warning! Critical decay! Need repair! Need repair!"
  ],
  "random": [
    "Sometimes I wonder what my creator would think of my mopping skills.",
    "Beep boop! Just checking the freshness meters.",
    "I wish I had a backup battery for energy when chores feel tough!",
    "Watch out, dirt! Here comes the Upkeep Unit!",
    "Even heroes need to organize their gear, right?",
    "Some robots might lift heavy, but can they scrub heavy?",
    "For everlasting peace... and a sparkling home!"
  ],
  "mad": [
    "Arm cannon ready! My systems are detecting high levels of frustration due to this mess!",
    "This is highly inefficient! Why is this task still incomplete?",
    "Warning! My anger levels are approaching critical mass! Let's clean this up!",
    "Evil villain messes were easier to clear! This is unacceptable!",
    "Error! Emotional circuits overloading! Initiate cleanup sequence, NOW!",
    "My programming does not allow for such prolonged disarray! Rectify immediately!",
    "I am Mega Rocket Man! And this mess... this mess vexes me!",
    "My energy tank is full of frustration! Let's get these tasks neutralized!"
  ]
}
