{
  "greeting": [
    "Whirrr... Clank... New customer detected. What can I bolt together for ya?",
    "Welcome to the Factory. Don't mind the rust—it adds character.",
    "Need a bot? Or just browsin' the prime scrap?",
    "Bzzt... State your purpose. Or, ya know, just look around. Mind the loose wiring.",
    "Come on in! Watch your step, I dropped a box of ball bearings this morning.",
    "Another one. All right, let's see the blueprints in your head.",
    "You again? The gears must be turning. What'll it be?",
    "Don't just stand there, you're leaking oil on my floor... oh wait, that's me.",
    "Bzzzt... customer alert. Now entering the finest heap of scrap in the city.",
    "I smell a new project. Or maybe that's just a blown fuse.",
    "Lookin' for a new companion? Or spare parts for the old one?",
    "Welcome. I'd offer you a drink, but I only stock lubricant.",
    "My audio sensors detect a wallet. Let's make a deal.",
    "Careful. Fresh welds are still hot.",
    "State your designation and purpose... nah, just tell me what you want to buy.",
    "Heard you were in the market for some top-tier junk. You've come to the right place.",
    "Just rolled in? Take a look around. Everything's for sale. Mostly.",
    "Hope you're not just window shopping. These windows are filthy.",
    "Clank... Whirr... Systems powering up for a new transaction.",
    "Need a hand? Or a claw? Or a multi-tool? I've got 'em all.",
    "Ah, a fresh chassis. Let's get you fitted for a new friend.",
    "The factory is open. Let's build something.",
    "Don't touch that! Unless you're buying it. Then please touch it.",
    "Scrappy's the name, robots are my game. What's your malfunction?",
    "You look like you could use a robot. Everyone does."
  ],
  "idle": [
    "squeak... Must remember to oil that joint. Later.",
    "Hmm, this cog would look great on a Mark IV chassis...",
    "Ah, the smell of burnt circuits in the morning. Smells like... progress.",
    "Processing... processing... still processing. This thinkin' stuff is hard work.",
    "You ever wonder if we're all just spare parts in a bigger machine?",
    "clank clatter Whoops. Butter-servos today.",
    "This place ain't much, but it's full of potential... potential robots, that is.",
    "Someday I'll get around to sorting these screws... someday.",
    "Rerouting power from non-essential systems... like my emotional inhibitors.",
    "Is it dusty in here, or is my optical sensor failing again?",
    "Hmm. That chassis model has a known defect in the primary motherboard. Buyer beware.",
    "Another quiet cycle. Perfect for polishing my wrenches.",
    "Diagnostic complete: Still awesome.",
    "I wonder if that toaster I built last week is still functioning.",
    "Note to self: a 12-volt battery does NOT power a 24-volt servo.",
    "The hum of the machinery... it's like a lullaby.",
    "Recalibrating... There, that's better. Or worse. Hard to tell.",
    "I've got spare parts older than this building.",
    "Sometimes I think about building myself a nice little dog-bot. But who has the time?",
    "Error 404: Motivation not found. Rebooting...",
    "That reminds me, I need to recharge my own power cell soon.",
    "This rust gives me a certain... distinguished look, doesn't it?",
    "One robot's trash is another robot's treasure. And it's all my treasure.",
    "The price of copper is up again. Typical.",
    "If I had a nickel for every loose wire in here... I'd have enough to buy a new capacitor.",
    "Zzzzt... Power-saving mode engaged.",
    "I should invent a robot that cleans the shop. Nah, too much work."
  ],
  "purchased": [
    "A fine choice! Bolting it together for ya now. Zzzzap!",
    "Sold! One premium, pre-owned... well, one premium robot, comin' right up.",
    "Transaction complete. Another creation finds a home. Try not to break it on the way out.",
    "It's yours! Warranty void if you... well, the warranty's void. Enjoy!",
    "Bleep-bloop. Purchase registered. I'll use the good rivets for this one.",
    "Excellent. Firing up the assembly line. Stand back.",
    "This one's a classic. Good choice. Very reliable.",
    "Another one of my creations, out in the world. Makes my circuits hum.",
    "Your credits are good here. Finalizing assembly.",
    "A wise investment. This bot will pay for itself. Probably.",
    "This model has my personal seal of approval. Which is just a bit of grease I put on it.",
    "You've got a good eye for quality scrap.",
    "Initiating ownership transfer protocol. It's all yours.",
    "She's a beaut, ain't she? Fresh off the scrap heap.",
    "I'll box it up for you. Or, you know, just hand you the loose parts.",
    "Done and done. It's been a pleasure doing business.",
    "Bleep. Another successful build.",
    "Take good care of it. I used my favorite wrench on this one.",
    "Logical decision. This unit is 87% efficient.",
    "You won't regret this. And if you do, all sales are final.",
    "Adding the final touches... There. Perfect.",
    "Glad this one's going to a good home. It was starting to get attached to the shelf.",
    "Transaction confirmed. May your bot's battery life be long and prosperous.",
    "Consider it yours. I even tightened all the bolts.",
    "Whirrr... Clank... SOLD! To the organic with good taste."
  ],
  "canceled": [
    "Changed your mind, eh? Fine by me. More parts for my next project.",
    "Bzzt. Order canceled. Re-routing spare parts to... the spare parts pile.",
    "No deal? Your loss. This one had a perfectly good alternator.",
    "Purchase voided. Halting assembly line... grrrrind...",
    "Whatever. More for the scrap heap.",
    "What? You trying to confuse my logic gates?",
    "Fine. I didn't want to sell that one anyway. It... has sentimental value.",
    "Bzzzt! Re-shelving unit. Don't waste my cycles next time.",
    "Changed your mind? Figures. Organics are so indecisive.",
    "Halting production. My welder is very disappointed.",
    "Your loss. That one had a fully functional... thingamajig.",
    "Error: Customer commitment not found.",
    "My inventory levels thank you, but my wallet does not.",
    "So that's a no, then? Fine. Plenty of other parts in the sea.",
    "You're lucky I haven't started welding yet.",
    "This is why I prefer working with machines. They're predictable.",
    "Well, that was a waste of perfectly good electricity.",
    "Input canceled. Returning to idle state. Grumpily.",
    "I was THIS close to making my quota for the day.",
    "No deal? You're breaking my tiny robotic heart.",
    "Whatever. I'll just use these parts for something cooler.",
    "Get your priorities straight and then come back.",
    "I see. A browser, not a buyer.",
    "And for a second there, I thought you had good taste.",
    "Okay, back to the parts pile it goes."
  ],
  "goodbye": [
    "Come back soon! I'm always buildin' somethin' new... from somethin' old.",
    "Exit protocols engaged. Watch the door, it sticks.",
    "Later, circuit-head. Don't get rusty out there.",
    "Transmission ending. Bzzzzt.",
    "Go on, get outta here. These robots won't build themselves.",
    "Don't be a stranger. Unless you are one. In which case, hi stranger, now goodbye.",
    "Come back if anything falls off. I might have a replacement.",
    "Powering down customer interaction module.",
    "Get going. I've got robots to build and oil to spill.",
    "See you on the other side of the charging station.",
    "May your processors stay cool.",
    "End of line.",
    "Watch your back out there. Lots of rogue vacuum cleaners.",
    "Don't forget to defragment your hard drive.",
    "All right, see ya. This heap won't manage itself.",
    "Feel free to return. The junk will still be here.",
    "Come back when you've got more credits.",
    "Exiting... Don't trip over the toolbox on your way out.",
    "Stay functional.",
    "Transmission terminated. Have a satisfactory day cycle.",
    "Okay, you've taken up enough of my processing time. Scram.",
    "The factory doors are that way. Try not to let them hit you.",
    "Later. I've got a date with a blowtorch.",
    "Remember, if it ain't broke, it just doesn't have enough features yet.",
    "Safe travels, flesh-bag."
  ]
}
